import React, {useState, useEffect, useRef} from 'react'
import * as am4core from "@amcharts/amcharts4/core";
import * as am4charts from "@amcharts/amcharts4/charts";
import am4themes_dark from "@amcharts/amcharts4/themes/dark";
import am4themes_animated from "@amcharts/amcharts4/themes/animated";
am4core.useTheme(am4themes_dark);
am4core.useTheme(am4themes_animated);

let data ={
        "Медицинская клиника": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        },
        "Аптека": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        },
        "Расчеты с персоналом": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        },
        "IT": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        },
        "Хозяйственная часть": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        },
        "Мед.Оборудование, Мебель": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        },
        "Пресс-Служба": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        },
        "Медицинский склад": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        },
        "Касса": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        },
        "Колл-Центр": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        },
        "Все ЦФО": {
            "2019": {
                "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2020": {
                "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            },
            "2021": {
                "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
                "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
            }
        }
    }
    
export default function CFODashGrafTwo(props) {
    let chartGrafTwo = useRef(null);
    const Data = () =>{
        let months = ["янв", "фев", "мар", "апр", "май", "июн", "июл", "авг", "сен", "окт", "ноя", "дек"];
        let meaning = [];
        for(let cfo in data){
            if(props.cfo == cfo){
                for(let year in data[cfo]){
                    if(props.selyear == year){
                        for(let month in data[cfo][year]){
                            if(props.selmonth == month){
                                meaning = data[cfo][year][month]
                            }
                        }
                    }
                }
            }
        }
        var chartData = [];
      for (var i = 0; (i < meaning.length); i++) {
        chartData.push({
          month: months[i],
          value: TypeText(meaning[i])
        });
      }
      return chartData;
    }
    const TypeText = (num) =>{
        if(typeof(num) != "string"){
            return `${new Intl.NumberFormat('ru-RU').format(num)}`  
        }
           return num    
    }
    useEffect(() => {    
    chartGrafTwo.current = am4core.create("chartGrafTwo", am4charts.XYChart);
    
    chartGrafTwo.current.data = Data();
    
    chartGrafTwo.current.fontFamily = 'Montserrat';
    chartGrafTwo.current.fontSize = '80%';

    var categoryAxis = chartGrafTwo.current.xAxes.push(new am4charts.CategoryAxis());
    categoryAxis.renderer.grid.template.location = 0;
    categoryAxis.renderer.ticks.template.disabled = true;
    categoryAxis.renderer.line.opacity = 0;
    categoryAxis.renderer.grid.template.disabled = true;
    categoryAxis.renderer.minGridDistance = 40;
    categoryAxis.dataFields.category = "month";
    categoryAxis.startLocation = 0.4;
    categoryAxis.endLocation = 0.6;
    // categoryAxis.renderer.labels.template.rotation = 330
    // categoryAxis.renderer.labels.template.verticalCenter = "top";
    // categoryAxis.renderer.labels.template.horizontalCenter = "right";

    var valueAxis = chartGrafTwo.current.yAxes.push(new am4charts.ValueAxis());
    valueAxis.tooltip.disabled = true;
    valueAxis.renderer.line.opacity = 0;
    valueAxis.renderer.ticks.template.disabled = true;
    valueAxis.min = 0;

    var lineSeries = chartGrafTwo.current.series.push(new am4charts.LineSeries());
    lineSeries.dataFields.categoryX = "month";
    lineSeries.dataFields.valueY = "value";
    lineSeries.tooltipText = "Расходы: {valueY.value} руб";
    lineSeries.fillOpacity = 0.2;
    let gradieent = new am4core.LinearGradient();
    gradieent.addColor("#ffi", 0.1);
    gradieent.addColor("#ff3a33", 1);
    gradieent.rotation = 90;
    lineSeries.fill = gradieent;
    lineSeries.stroke = am4core.color("#ff3a33");
    lineSeries.tensionX = 0.88;
    lineSeries.segments.template.strokeWidth = 3.3;
    lineSeries.stroke = am4core.color("#ff3a33");
    lineSeries.segments.template.strokeWidth = 3.5;
    
    var bullet = lineSeries.bullets.push(new am4charts.CircleBullet());
    bullet.circle.radius = 4;
    bullet.circle.fill = am4core.color("#ff3a33");

    chartGrafTwo.current.cursor = new am4charts.XYCursor();

    
    });
    useEffect(() => {
        chartGrafTwo.current.data = Data();
    });

    return(
            <div id="chartGrafTwo"></div>

    )
}