import React, {useState} from 'react';
import CFODashGrafOne from './CFODashGrafOne';
import CFODashGrafTwo from './CFODashGrafTwo';
import CFODashGrafThree from './CFODashGrafThree';
import CFODashInfoBlock from './CFODashInfoBlock'
let date = {
    'year': [2019, 2020, 2021],
    'month': ['Все месяца', "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
}
let data = {
    "Медицинская клиника": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Аптека": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Расчеты с персоналом": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "IT": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Хозяйственная часть": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Мед.Оборудование, Мебель": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Пресс-Служба": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Медицинский склад": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Касса": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Колл-Центр": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Все ЦФО": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    }
}
export default function CFODash() {
    const [selyear, setSelyear] = useState(2021);
    const [selmonth, setSelmonth] = useState("Все месяца");
    const [graf, setGraf] = useState("СУММА ПО КАЖДОМУ ЦЕНТРУ ФИНАНСОВОЙ ОТЧЕТНОСТИ");
    const [cfo, setCfo] = useState("Все ЦФО")
    const SelectYear=(event)=>{
        setSelyear(event.target.value)
    }
    const SelectMonth=(event)=>{
        setSelmonth(event.target.value)
    }
    const SelectCfo=(event)=>{
        setCfo(event.target.value)
    }
    const Graf = (event) =>{
        setGraf(event.target.innerText);
        if(!event.target.classList.contains('dashtop_title_selected')){
            let selectedOn = document.querySelectorAll('.dashTop__title div')
            for(let i in selectedOn){
                if(selectedOn[i].classList.contains('dashtop_title_selected')){
                    selectedOn[i].classList.remove('dashtop_title_selected')
                    break;
                }
            }
            event.target.classList.add('dashtop_title_selected');
        }
    }
    return(
        <div className = "dashContent">
            <div className = 'selects'>
                <div className='selects__year'>
                    <span>Год: </span>
                    <select className = 'Dash__YearSelect' defaultValue = "2021" onChange={SelectYear}>
                    {
                    date.year.map((item, index) =>{
                            return(
                                <AddOptions date = {item} key = {index}/>
                            )
                        })
                    }
                </select>
                </div>
                <div className='selects__month displayNone'>
                    <span>Месяц: </span>
                    <select className = 'Dash__MonthSelect' onChange={SelectMonth}>
                    {
                        date.month.map((item, index) =>{
                            return(
                                <AddOptions date = {item} key = {index}/>
                            )
                        })
                    }
                </select>
                </div>
                <div className='selects__cfo selects__month'>
                    <span>ЦФО: </span>
                    <select className = 'Dash__CFOSelect Dash__MonthSelect' defaultValue = "Все ЦФО" onChange={SelectCfo}>
                    {
                    Object.keys(data).map((item, index) =>{
                            return(
                                <AddOptions date = {item} key = {index}/>
                            )
                        })
                    }
                </select>
                </div>
            </div>
                <div className = "CFO__content">
                    <div className = "dashtop">
                        <div className = "dashTop__title">
                            <div id = "sum" className = "CFODashGrafTitle dashtop_title_selected" onClick = {Graf}>Сумма по каждому центру финансовой отчетности</div>
                            <div id = "rash" className = "CFODashGrafTitle" onClick = {Graf}>Расходование средств</div>
                        </div>
                        {                        
                        (graf == "Сумма по каждому центру финансовой отчетности".toUpperCase())? (
                            
                            <CFODashGrafOne selyear = {selyear} selmonth = {selmonth}/>
                        ):(
                            <CFODashGrafTwo selyear = {selyear} selmonth = {selmonth} cfo = {cfo}/>
                        )
                    }
                    </div>
                    <div className = "infoblock">
                        <CFODashGrafThree selyear = {selyear} selmonth = {selmonth} cfo = {cfo}/>
                        <CFODashInfoBlock selyear = {selyear} selmonth = {selmonth} cfo = {cfo}/>
                    </div>
                </div>
        </div>
    )
}

function  AddOptions(props) {
    return(
        <option>{props.date} </option>
      )
}