let data ={
    "Медицинская клиника": {
        "2019": {
            "Все месяца": 3293173,
            "Январь": 24124214
        },
        "2020": {
            "Все месяца": 3243244,
            "Январь": 657567675
        },
        "2021": {
            "Все месяца": 65756765,
            "Январь": 567567575
        }
    },
    "Аптека": {
        "2019": {
            "Все месяца": 124144,
            "Январь": 24124214
        },
        "2020": {
            "Все месяца": 3243244,
            "Январь": 657567675
        },
        "2021": {
            "Все месяца": 65756765,
            "Январь": 567567575
        }
    },
    "Расчеты с персоналом": {
        "2019": {
            "Все месяца": 124144,
            "Январь": 24124214
        },
        "2020": {
            "Все месяца": 3243244,
            "Январь": 657567675
        },
        "2021": {
            "Все месяца": 65756765,
            "Январь": 567567575
        }
    },
    "IT": {
        "2019": {
            "Все месяца": 124144,
            "Январь": 24124214
        },
        "2020": {
            "Все месяца": 3243244,
            "Январь": 657567675
        },
        "2021": {
            "Все месяца": 65756765,
            "Январь": 567567575
        }
    },
    "Хозяйственная часть": {
        "2019": {
            "Все месяца": 124144,
            "Январь": 24124214
        },
        "2020": {
            "Все месяца": 3243244,
            "Январь": 657567675
        },
        "2021": {
            "Все месяца": 65756765,
            "Январь": 567567575
        }
    },
    "Мед.Оборудование, Мебель": {
        "2019": {
            "Все месяца": 124144,
            "Январь": 24124214
        },
        "2020": {
            "Все месяца": 3243244,
            "Январь": 657567675
        },
        "2021": {
            "Все месяца": 65756765,
            "Январь": 567567575
        }
    },
    "Пресс-Служба": {
        "2019": {
            "Все месяца": 124144,
            "Январь": 24124214
        },
        "2020": {
            "Все месяца": 3243244,
            "Январь": 657567675
        },
        "2021": {
            "Все месяца": 65756765,
            "Январь": 567567575
        }
    },
    "Медицинский склад": {
        "2019": {
            "Все месяца": 124144,
            "Январь": 24124214
        },
        "2020": {
            "Все месяца": 3243244,
            "Январь": 657567675
        },
        "2021": {
            "Все месяца": 65756765,
            "Январь": 567567575
        }
    },
    "Касса": {
        "2019": {
            "Все месяца": 124144,
            "Январь": 24124214
        },
        "2020": {
            "Все месяца": 3243244,
            "Январь": 657567675
        },
        "2021": {
            "Все месяца": 65756765,
            "Январь": 567567575
        }
    },
    "Колл-Центр": {
        "2019": {
            "Все месяца": 124144,
            "Январь": 24124214
        },
        "2020": {
            "Все месяца": 3243244,
            "Январь": 657567675
        },
        "2021": {
            "Все месяца": 65756765,
            "Январь": 567567575
        }
    }
}

let data ={
    "Медицинская клиника": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    },
    "Аптека": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    },
    "Расчеты с персоналом": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    },
    "IT": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    },
    "Хозяйственная часть": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    },
    "Мед.Оборудование, Мебель": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    },
    "Пресс-Служба": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    },
    "Медицинский склад": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    },
    "Касса": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    },
    "Колл-Центр": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    },
    "Все ЦФО": {
      "2019": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2020": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      },
      "2021": {
        "Все месяца": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ],
        "Январь": [
          {
            name: "ОМС",
            sum: 735454,
          },
          {
            name: "Коммерция",
            sum: 735454,
          },
          {
            name: "Без счета",
            sum: 735454,
          }
        ]
      }
    }
  }

let data ={
    "Медицинская клиника": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Аптека": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Расчеты с персоналом": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "IT": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Хозяйственная часть": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Мед.Оборудование, Мебель": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Пресс-Служба": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Медицинский склад": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Касса": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Колл-Центр": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    },
    "Все ЦФО": {
        "2019": {
            "Все месяца": [12324, 1232, 54365, 45654, 4354, 12313, 15432, 9877, 1232, 4325, 12321, 43215 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2020": {
            "Все месяца": [3324, 2432, 1465, 2554, 6354, 7213, 5432, 3977, 3732, 2725, 2221, 1315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        },
        "2021": {
            "Все месяца": [5324, 7232, 2465, 9554, 5354, 7213, 12432, 4977, 4132, 2725, 7221, 8315 ],
            "Январь": [1324, 2232, 5465, 4554, 4354, 1213, 1432, 1977, 1732, 4725, 1221, 4315 ]
        }
    }
}

let data ={
    "Медицинская клиника": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 6730123,
                sumndscfo: 91213122,
                paid: 2430135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        }
    },
    "Аптека": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 2230123,
                sumndscfo: 993122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        }
    },
    "Расчеты с персоналом": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 2230123,
                sumndscfo: 993122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        }
    },
    "IT": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 2230123,
                sumndscfo: 993122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        }
    },
    "Хозяйственная часть": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 2230123,
                sumndscfo: 993122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        }
    },
    "Мед.Оборудование, Мебель": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 2230123,
                sumndscfo: 993122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        }
    },
    "Пресс-Служба": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 2230123,
                sumndscfo: 993122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        }
    },
    "Медицинский склад": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 2230123,
                sumndscfo: 993122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        }
    },
    "Касса": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 2230123,
                sumndscfo: 993122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        } 
    },
    "Колл-Центр": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 2230123,
                sumndscfo: 993122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        }
    },
    "Все ЦФО": {
        "2019": {
            "Все месяца": {
                sumcfo: 2350123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 1350123,
                sumndscfo: 2123122,
                paid: 20135
            }
        },
        "2020": {
            "Все месяца": {
                sumcfo: 2230123,
                sumndscfo: 993122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 4350123,
                sumndscfo: 912312,
                paid: 20135
            }
        },
        "2021": {
            "Все месяца": {
                sumcfo: 2150123,
                sumndscfo: 1123122,
                paid: 20135
            },
            "Январь": {
                sumcfo: 5150123,
                sumndscfo: 123122,
                paid: 20135
            }
        }
    }
}

let dataTable = {
  "2020": {
      "Все месяца": {
          "meaning": {
              "income": 423608221,
              "expense": 382468377
          },
          "data": {
              "Январь": {
                  "meaning": {
                      "income": 9698272,
                      "expense": 11872328
                  },
                  "data": {
                      "Поступление от финансовой деятельности": { 
                          "meaning": {
                              "income": 6210000,
                              "expense": 0
                          },
                          "data": {
                              "Получение кредитов и займов": { 
                                  "meaning": {
                                      "income": 6210000,
                                      "expense": 0
                                  },
                                  "data": {
                                      "Получение кредитов и займов": { 
                                          "meaning": {
                                              "income": 6210000,
                                              "expense": 0
                                          }
                                      }
                                  }
                              }
                          }
                      },
                      "Поступление по операционной деятельности": { 
                          "meaning": {
                              "income": 6210000,
                              "expense": 0
                          },
                          "data": {
                              "Выручка от оказания медицинских услуг": { 
                                  "meaning": {
                                      "income": 6210000,
                                      "expense": 0
                                  },
                                  "data": {
                                      "КМЦ Выручка от оказания медицинских услуг": { 
                                          "meaning": {
                                              "income": 6210000,
                                              "expense": 0
                                          }
                                      }
                                  }
                              }
                          }
                      },
                      "Расходы по инвестиционной деятельности": { 
                          "meaning": {
                              "income": 0,
                              "expense": 6210000
                          },
                          "data": {
                              "Расходы на приобретение основных средств и нематериальных активов": { 
                                  "meaning": {
                                      "income": 0,
                                      "expense": 6210000
                                  },
                                  "data": {
                                      "ИТ-оборудование": { 
                                          "meaning": {
                                              "income": 0,
                                              "expense": 6210000
                                          }
                                      }
                                  }
                              }
                          }
                      },
                      "Расходы по операционной деятельности (косвенные)": { 
                          "meaning": {
                              "income": 0,
                              "expense": 6210000
                          },
                          "data": {
                              "Административные расходы": { 
                                  "meaning": {
                                      "income": 0,
                                      "expense": 6210000
                                  },
                                  "data": {
                                      "Инкассация": { 
                                          "meaning": {
                                              "income": 0,
                                              "expense": 6210000
                                          }
                                      },
                                      "Представительские расходы": { 
                                          "meaning": {
                                              "income": 0,
                                              "expense": 6210000
                                          }
                                      },
                                      "Прочие выплаты": { 
                                          "meaning": {
                                              "income": 0,
                                              "expense": 6210000
                                          }
                                      }
                                  }
                              }
                          }
                      }      
                  }
              },
              "Февраль": {
                  "meaning": {
                      "income": 9698272,
                      "expense": 11872328
                  },
                  "data": {
                      "Поступление от финансовой деятельности": { 
                          "meaning": {
                              "income": 6210000,
                              "expense": 0
                          },
                          "data": {
                              "Получение кредитов и займов": { 
                                  "meaning": {
                                      "income": 6210000,
                                      "expense": 0
                                  },
                                  "data": {
                                      "Получение кредитов и займов": { 
                                          "meaning": {
                                              "income": 6210000,
                                              "expense": 0
                                          }
                                      }
                                  }
                              }
                          }
                      }   
                  }
              }
          }
      } 
  }
}

let dataBDDSDash = {
  "inc":[
    [2020,9,8,4,3,7,9,14,4,6,4,7,11],
    [2021,3,5,4,8,11,7,16,13,9,9,7,6],
    [2022,7,9,14,3,5,4,9,7,6,5,7,12]
  ],
  "exp":[
    [2020,7,9,14,3,5,4,9,7,6,5,7,12],
    [2021,4,3,7,12,9,6,3,3,5,9,12,7],
    [2022,9,8,12,4,6,2,11,15,16,7,17,13]
  ]
}

let leasing = {
  "2020": {
    receipts: [12, 212, 213, 123, 323, 45, 45, 45, 32, 67, 56, 56,],  
    payments: [12, 212, 213, 123, 323, 45, 45, 45, 32, 67, 56, 56,]
  }
}
let leasingInfoBlock = {
  "2020": {
    sumReceipts: 19479231,  
    sumPayments: 16705436,
    remainder: 587091254
  }
}
let leasingInfoBlock = {
  "2020": {
    sumReceipts: 19479231,  
    sumPayments: 16705436,
    remainder: 587091254
  }
}

let dataMonthh = {
  "2019": {
      "Январь": {
          "income": 9698272,
          "expense": 11872328
      },            
      "Февраль": {
          "income": 6598272,
          "expense": 87872328
      },
      "Март": {
          "income": 928272,
          "expense": 5464872328
      },
      "Апрель": {
          "income": 33398272,
          "expense": 45472328
      },
      "Май": {
          "income": 11118272,
          "expense": 33272328
      }
},
  "2020": {
          "Январь": {
              "income": 9698272,
              "expense": 11872328
          },            
          "Февраль": {
              "income": 6598272,
              "expense": 87872328
          },
          "Март": {
              "income": 928272,
              "expense": 5464872328
          },
          "Апрель": {
              "income": 33398272,
              "expense": 45472328
          },
          "Май": {
              "income": 11118272,
              "expense": 33272328
          }
  },
  "2021": {
      "Январь": {
          "income": 9698272,
          "expense": 11872328
      },            
      "Февраль": {
          "income": 9698272,
          "expense": 11872328
      },
      "Март": {
          "income": 9698272,
          "expense": 11872328
      },
      "Апрель": {
          "income": 9698272,
          "expense": 11872328
      },
      "Май": {
          "income": 9698272,
          "expense": 11872328
      }
  }
}
let dataArticle = {
  "2019": {
      "Январь": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },            
      "Февраль": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },
      "Март": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },
      "Апрель": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },
      "Май": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      }
  },
  "2020": {
      "Январь": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },            
      "Февраль": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },
      "Март": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },
      "Апрель": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },
      "Май": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      }
  },
  "2021": {
      "Январь": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },            
      "Февраль": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },
      "Март": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },
      "Апрель": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      },
      "Май": {
          "Поступление от финансовой деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Поступление по операционной деятельности": {
              "income": 6598272,
              "expense": 0
          },
          "Расходы по операционной деятельности": {
              "income": 0,
              "expense": 87872328
          }
      }
  }
}
let dataUndArticle = {
  "2019": {
      "Январь": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },            
      "Февраль": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },
      "Март": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },
      "Апрель": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },
      "Май": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      }
  },
  "2020": {
      "Январь": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },            
      "Февраль": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },
      "Март": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },
      "Апрель": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },
      "Май": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      }
  },
  "2021": {
      "Январь": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },            
      "Февраль": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },
      "Март": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },
      "Апрель": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      },
      "Май": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "income": 6598272,
                  "expense": 0
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "income": 0,
                  "expense": 6598272
              },
              "Аренда и содержание помещений": {
                  "income": 0,
                  "expense": 6598272
              },
              "Налоги, сборы и пошлины": {
                  "income": 0,
                  "expense": 6598272
              }
          }
      }
  }
}
let dataSubArticle = {
  "2019": {
      "Январь": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },            
      "Февраль": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },
      "Март": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },
      "Апрель": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },
      "Май": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      }
  },
  "2020": {
      "Январь": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },            
      "Февраль": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },
      "Март": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },
      "Апрель": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },
      "Май": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      }
  },
  "2021": {
      "Январь": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },            
      "Февраль": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },
      "Март": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },
      "Апрель": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      },
      "Май": {
          "Поступление от финансовой деятельности": {
              "Получение кредитов и займов": {
                  "Получение кредитов и займов": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Поступление по операционной деятельности": {
              "Выручка от указания медицинских услуг": {
                  "КМЦ Выручка от указания медицинских услуг": {
                      "income": 6598272,
                      "expense": 0
                  }
              }
          },
          "Расходы по операционной деятельности": {
              "Административные расходы": {
                  "Инкассация": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Представительские пасходы": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Прочие выплаты и комиссии банку": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Аренда и содержание помещений": {
                  "Прочие расходы на аренду и содержание помещений": {
                      "income": 0,
                      "expense": 6598272
                  },
                  "Ремонтные работы": {
                      "income": 0,
                      "expense": 6598272
                  }
              },
              "Налоги, сборы и пошлины": {
                  "Прочие налоги": {
                      "income": 0,
                      "expense": 6598272
                  }
              }
          }
      }
  }
}
let date = {
  'year': [2019, 2020, 2021],
  'month': ['Все месяца', "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
}
let a = {
    "Сайдалхаджиев Мухаммад Салманович": {
        "2019": {
            id: 123213,
            services: [2233315, 7345623, 5343872, 9834732, 12348384, 12323121, 2343434, 3243242, 4353544, 6932742, 5434215, 7435345],
            sum: [2233315, 7345623, 5343872, 9834732, 12348384, 12323121, 2343434, 3243242, 4353544, 6932742, 5434215, 7435345],
            payients: [2233315, 7345623, 5343872, 9834732, 12348384, 12323121, 2343434, 3243242, 4353544, 6932742, 5434215, 7435345]
        },
        "2020": {
            id: 123213,
            services: [2233315, 7345623, 5343872, 9834732, 12348384, 12323121, 2343434, 3243242, 4353544, 6932742, 5434215, 7435345],
            sum: [2233315, 7345623, 5343872, 9834732, 12348384, 12323121, 2343434, 3243242, 4353544, 6932742, 5434215, 7435345],
            payients: [2233315, 7345623, 5343872, 9834732, 12348384, 12323121, 2343434, 3243242, 4353544, 6932742, 5434215, 7435345]
        },
        "2021": {
            id: 123213,
            services: [2233315, 7345623, 5343872, 9834732, 12348384, 12323121, 2343434, 3243242, 4353544, 6932742, 5434215, 7435345],
            sum: [2233315, 7345623, 5343872, 9834732, 12348384, 12323121, 2343434, 3243242, 4353544, 6932742, 5434215, 7435345],
            payients: [2233315, 7345623, 5343872, 9834732, 12348384, 12323121, 2343434, 3243242, 4353544, 6932742, 5434215, 7435345]
        }
    },
}
let infoblockData = {
    "Сайдалхаджиев Мухаммад Салманович": {
        "2019": {
            services: {
                quarter: {
                    fact: 60,
                    plan: 120
                },
                month: {
                    fact: 60,
                    plan: 120
                },
                week: {
                    fact: 60,
                    plan: 120
                }
            },
            patients: {
                quarter: {
                    fact: 60,
                    plan: 120
                },
                month: {
                    fact: 60,
                    plan: 120
                },
                week: {
                    fact: 60,
                    plan: 120
                }
            },
            sum: {
                quarter: {
                    fact: 60,
                    plan: 120
                },
                month: {
                    fact: 60,
                    plan: 120
                },
                week: {
                    fact: 60,
                    plan: 120
                }
            }
        },
        "2020": {
            services: {
                quarter: {
                    fact: 60,
                    plan: 120
                },
                month: {
                    fact: 60,
                    plan: 120
                },
                week: {
                    fact: 60,
                    plan: 120
                }
            },
            patients: {
                quarter: {
                    fact: 60,
                    plan: 120
                },
                month: {
                    fact: 60,
                    plan: 120
                },
                week: {
                    fact: 60,
                    plan: 120
                }
            },
            sum: {
                quarter: {
                    fact: 60,
                    plan: 120
                },
                month: {
                    fact: 60,
                    plan: 120
                },
                week: {
                    fact: 60,
                    plan: 120
                }
            }
        },
        "2021": {
            services: {
                quarter: {
                    fact: 60,
                    plan: 120
                },
                month: {
                    fact: 60,
                    plan: 120
                },
                week: {
                    fact: 60,
                    plan: 120
                }
            },
            patients: {
                quarter: {
                    fact: 60,
                    plan: 120
                },
                month: {
                    fact: 60,
                    plan: 120
                },
                week: {
                    fact: 60,
                    plan: 120
                }
            },
            sum: {
                quarter: {
                    fact: 60,
                    plan: 120
                },
                month: {
                    fact: 60,
                    plan: 120
                },
                week: {
                    fact: 60,
                    plan: 120
                }
            }
        }
    }
}
let infoblockData = {
    "Сайдалхаджиев Мухаммад Салманович": {
        "2019": {
            quarter: {
                fact: 60,
                plan: 120
            },
            month: {
                fact: 60,
                plan: 120
            },
            week: {
                fact: 60,
                plan: 120
            }
        },
        "2020": {
            quarter: {
                fact: 60,
                plan: 120
            },
            month: {
                fact: 235,
                plan: 120
            },
            week: {
                fact: 125,
                plan: 120
            }
        },
        "2021": {
            quarter: {
                fact: 60,
                plan: 120
            },
            month: {
                fact: 60,
                plan: 120
            },
            week: {
                fact: 60,
                plan: 120
            }
        }
    }
}

